<template>
  <v-container fluid>
    <v-layout justify-center wrap class="my-4" align-center>
      <section>
        <h2>എന്താണ് മലയാളം സ്പീച്ച് കോർപ്പസ്?</h2>
        <div>
          <p>
            മലയാളത്തിൽ ഒരു ശബ്ദസഞ്ചയം ഉണ്ടാക്കാനായി സ്വതന്ത്ര മലയാളം
            കമ്പ്യൂട്ടിങ്ങിന്റെ ഒരു ഉദ്യമമാണ് ഇത്. ഇതിൽ നിങ്ങൾക്ക്
            മലയാളത്തിലുള്ള വാചകങ്ങൾ വായിച്ച് റെക്കോഡ് ചെയ്യാനും മറ്റുള്ളവർ
            വായിച്ചത് കേട്ടുനോക്കി ശരിവെക്കുവാനും പറ്റും. മലയാളത്തിലെ
            വാചകങ്ങളുടെയും അതിനിണങ്ങിയ വായനയുടെയും ഒരു ശേഖരമുണ്ടാക്കുകയാണ്
            നമ്മുടെ ലക്ഷ്യം. ഇതുപയോഗിച്ചുകൊണ്ട് മലയാളം വായിക്കാനും
            കേട്ടുമനസ്സിലാക്കാനും സാധിക്കുന്ന കമ്പ്യൂട്ടിങ്ങ്
            സംവിധാനങ്ങളിലേയ്ക്ക് നമുക്ക് വളരാനാകും.
          </p>
          <h2>റെക്കോഡ് ചെയ്യുന്നതെങ്ങനെ?</h2>
          <p>
            വാചകങ്ങൾ സ്ക്രീനിൽ പ്രത്യക്ഷപ്പെടുമ്പോൾ മൈക്ക് ബട്ടണിൽ ഒന്ന്
            തട്ടിയതിനുശേഷം വായിച്ചുതുടങ്ങുക. വായിച്ചുകഴിയുമ്പോൾ ആ ബട്ടണിൽ ഒന്നു
            കൂടി തട്ടുക. നിങ്ങളുടെ ശബ്ദം അപ്പോൾ ശേഖരിക്കപ്പെട്ടിട്ടുണ്ടാകും.
          </p>
          <p>
            വായിച്ചത് ശരിതന്നെയാണൊ എന്ന് അതിനു ശേഷം കേട്ടുനോക്കാം. തൃപ്തി
            ആയിട്ടില്ലെങ്കിൽ ആ ശബ്ദം ഡെലീറ്റ് ചെയ്തിട്ട് വീണ്ടും റെക്കോഡ്
            ചെയ്യാം.
          </p>
          <h3>റെക്കോഡ് ചെയ്യുമ്പോൾ എന്തൊക്കെ ശ്രദ്ധിക്കണം?</h3>
          <ol>
            <li>
              ചുറ്റുപാടും മറ്റു ശബ്ദശല്യങ്ങൾ ഒന്നുമില്ലെന്ന് ഉറപ്പുവരുത്തണം.
            </li>
            <li>
              വായിക്കുമ്പോൾ നിങ്ങളുടെ ശബ്ദത്തിലെ പ്രാദേശികഭേദം പ്രശ്നമാകില്ല.
              പക്ഷേ വായിക്കാനായി തന്നിരിക്കുന്ന വാചകങ്ങളിലെ വാക്കുകൾക്ക്
              തത്തുല്യമായ മറ്റ് പ്രാദേശികരൂപങ്ങൾ ഉപയോഗിക്കാൻ പാടില്ല.
            </li>
            <li>
              മൈക്രോഫോൺ ഉപയോഗിച്ചു റെക്കോഡ് ചെയ്താൽ മികച്ച നിലവാരത്തിലുള്ള ശബ്ദം
              കിട്ടുന്നതാണ്.
            </li>
          </ol>
          <h2>കേട്ടു ശരിവെക്കുന്നതെങ്ങനെ?</h2>
          <p>
            റിവ്യൂ (review) എന്ന ബട്ടണിൽ അമർത്തിയാൽ മറ്റുള്ളവർ റെക്കോഡ് ചെയ്ത
            ശബ്ദം നിങ്ങൾക്ക് കേൾക്കാം.
          </p>
          <p>
            നല്ല റെക്കോഡിങ്ങാണെങ്കിൽ 👍(upvote) ചെയ്യുക. അല്ലെങ്കിൽ 👎(downvote)
            ചെയ്യുക.
          </p>
          <h3>👍(upvote) ചെയ്യുമ്പോൾ</h3>
          <ol>
            <li>
              തന്നിരിക്കുന്ന വാചകം തന്നെയാണ് വായിച്ചിരിക്കുന്നതെന്ന്
              ഉറപ്പുവരുത്തുക.
            </li>
            <li>
              ചുറ്റുപാടും നിന്നുള്ള മറ്റുശബ്ദങ്ങൾ (ടെലിവിഷൻ, ഫോൺ ബെൽ, മറ്റു
              സംസാരം) ഇവയൊന്നും ഇല്ലെന്ന് ഉറപ്പുവരുത്തുക.
            </li>
            <li>
              ഉച്ചാരണപ്പിശകുകൾ ഇല്ലെന്ന് ഉറപ്പു വരുത്തുക.
            </li>
          </ol>
          <p>
            എങ്ങനെ വോട്ട് ചെയ്യണമെന്ന് തീരുമാനം എടുക്കാൻ കഴിയുന്നില്ലെങ്കിൽ
            വോട്ട് ചെയ്യാതെ അടുത്ത റെക്കോഡിങ്ങിലേയ്ക്ക് പോകാം.
          </p>
          <h2>നിങ്ങളുടെ പ്രൊഫൈൽ</h2>
          <p>
            നിങ്ങളുടെ പേര്, വയസ്സ്, ലിംഗഭേദം എന്നിവ നിങ്ങൾക്ക് പ്രൊഫൈലിൽ
            രേഖപ്പെടുത്താവുന്നതാണ്. ഇതിനായി ലോഗിൻ ചെയ്തതിനു ശേഷം വലതു
            മുകളിലായുള്ള പ്രൊഫൈൽ ലിങ്കിൽ ക്ലിക്ക് ചെയ്താൽ മതി.
          </p>
        </div>
      </section>
    </v-layout>
  </v-container>
</template>

<script>
export default {
  name: "Usage"
};
</script>
